In [1]:
import pandas as pd

In [2]:
dataset = pd.read_excel('50 StartUp Companies Database.xlsx')
dataset.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [3]:
(dataset['State']).nunique()

3

In [4]:
X = dataset.iloc[:,:-1]
y = dataset.iloc[:,-1]

In [5]:
states = pd.get_dummies(X['State'],drop_first=True)

In [6]:
X = pd.concat([X,states],axis=1)

In [7]:
X.head()

   R&D Spend  Administration  Marketing Spend       State  Florida  New York
0  165349.20       136897.80        471784.10    New York        0         1
1  162597.70       151377.59        443898.53  California        0         0
2  153441.51       101145.55        407934.54     Florida        1         0
3  144372.41       118671.85        383199.62    New York        0         1
4  142107.34        91391.77        366168.42     Florida        1         0

In [8]:
X= X.drop('State',axis=1)

In [10]:
X.head()

   R&D Spend  Administration  Marketing Spend  Florida  New York
0  165349.20       136897.80        471784.10        0         1
1  162597.70       151377.59        443898.53        0         0
2  153441.51       101145.55        407934.54        1         0
3  144372.41       118671.85        383199.62        0         1
4  142107.34        91391.77        366168.42        1         0

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

In [13]:
from sklearn.linear_model import LinearRegression

In [14]:
Lin_reg = LinearRegression()

In [15]:
Lin_reg.fit(X_train,y_train)

LinearRegression()

In [16]:
y_pred = Lin_reg.predict(X_test)

In [17]:
from sklearn.metrics import r2_score

In [18]:
score = r2_score(y_test,y_pred)
score

0.9475312056928278